tutorials/multiphase/interDyMFoam/ras/sloshingTank3D6DoF/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

m4 system/blockMeshDict.m4 > system/blockMeshDict
runApplication blockMesh
cp 0/alpha.water.orig 0/alpha.water
runApplication setFields
runApplication `getApplication`

#------------------------------------------------------------------------------
